INTELPRO-INC/IPRO-SDK/apps/platform/ipro7_demo/demo/esp32_at/demo_esp32_at.c
/*
 * demo_esp32_at.c - ESP32-AT network application demo suite.
 *
 * Five shell commands showing customers how to build network applications
 * on top of the ESP32 AT client:
 *
 *   demo_wifi_scan                      - Scan and pretty-print nearby APs
 *   demo_net_info                       - Show link info (SSID, RSSI, IP, DNS)
 *   demo_net_ping <host> [count]        - Ping over the ESP32 link
 *   demo_http_get <url>                 - Fetch a URL via AT+HTTPCGET
 *   demo_reconnect_loop <iter>          - Repeatedly disconnect + reconnect,
 *                                         report success rate via event CB
 *
 * All demos rely on the public APIs in esp32_wifi_at.h. Customers can copy
 * any of these functions into their own application as a starting point.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <FreeRTOS.h>
#include <task.h>
#include <semphr.h>

#include "shell.h"
#include "esp32_wifi_at.h"
#include "mjpeg_frames.h"

#define DEMO_RESP_BUF   3072        /* large enough for AT+CWLAP (~15 APs) */
#define DEMO_URL_MAX    256

/* ------------------------------------------------------------------ */
/* Helpers                                                             */
/* ------------------------------------------------------------------ */

static int demo_require_link(void)
{
    esp32_wifi_state_t st = esp32_wifi_get_state();
    if (st == ESP32_WIFI_STATE_OFF) {
        printf("[demo] ESP32 not initialized. Run: esp32_wifi_init\r\n");
        return -1;
    }
    return 0;
}

static int demo_require_ip(void)
{
    if (demo_require_link() != 0)
        return -1;
    if (esp32_wifi_get_state() != ESP32_WIFI_STATE_GOT_IP) {
        printf("[demo] No IP yet. Run: esp32_wifi_connect <ssid> <pw>\r\n");
        return -1;
    }
    return 0;
}

/* ------------------------------------------------------------------ */
/* Case 1: Wi-Fi scan                                                  */
/* ------------------------------------------------------------------ */

static int cmd_demo_wifi_scan(int argc, char **argv)
{
    (void)argc; (void)argv;

    if (demo_require_link() != 0)
        return -1;

    static char resp[DEMO_RESP_BUF];
    printf("[demo] Issuing AT+CWLAP (scan may take up to 10 s)...\r\n");
    int rc = esp32_wifi_at_cmd("AT+CWLAP", resp, sizeof(resp), 10000);
    if (rc != 0) {
        printf("[demo] Scan failed (rc=%d): %s\r\n", rc, resp);
        return rc;
    }

    /* Each line looks like:
     *   +CWLAP:(<ecn>,"<ssid>",<rssi>,"<bssid>",<ch>,...)
     * ecn values: 0=OPEN 1=WEP 2=WPA 3=WPA2 4=WPA/WPA2 5=WPA2-Ent 6=WPA3 7=WPA2/WPA3
     */
    static const char *enc[] = {
        "OPEN", "WEP", "WPA", "WPA2", "WPA/WPA2", "WPA2E", "WPA3", "WPA2/3"
    };

    printf("\r\n  # | %-24s | %-17s | CH | RSSI | SEC\r\n", "SSID", "BSSID");
    printf("----+--------------------------+-------------------+----+------+--------\r\n");

    int n = 0;
    const char *p = resp;
    while ((p = strstr(p, "+CWLAP:(")) != NULL) {
        p += 8;
        int ecn = 0, rssi = 0, ch = 0;
        char ssid[64] = {0}, bssid[32] = {0};
        /* strict parse of first five fields */
        if (sscanf(p, "%d,\"%63[^\"]\",%d,\"%31[^\"]\",%d",
                   &ecn, ssid, &rssi, bssid, &ch) >= 4) {
            const char *sec = (ecn >= 0 && ecn < (int)(sizeof(enc)/sizeof(enc[0])))
                              ? enc[ecn] : "?";
            printf(" %2d | %-24s | %-17s | %2d | %4d | %s\r\n",
                   ++n, ssid[0] ? ssid : "<hidden>", bssid, ch, rssi, sec);
        }
    }
    printf("\r\nTotal: %d AP(s)\r\n", n);
    return 0;
}

/* ------------------------------------------------------------------ */
/* Case 2: Network info (SSID / RSSI / IP / DNS)                       */
/* ------------------------------------------------------------------ */

static int cmd_demo_net_info(int argc, char **argv)
{
    (void)argc; (void)argv;

    if (demo_require_ip() != 0)
        return -1;

    char resp[512];

    /* AT+CWJAP? returns: +CWJAP:"ssid","bssid",ch,rssi,... */
    if (esp32_wifi_at_cmd("AT+CWJAP?", resp, sizeof(resp), 2000) == 0) {
        const char *p = strstr(resp, "+CWJAP:");
        if (p) {
            char ssid[64] = {0}, bssid[32] = {0};
            int ch = 0, rssi = 0;
            if (sscanf(p + 7, "\"%63[^\"]\",\"%31[^\"]\",%d,%d",
                       ssid, bssid, &ch, &rssi) >= 4) {
                printf("Associated : SSID=%s  BSSID=%s  CH=%d  RSSI=%d dBm\r\n",
                       ssid, bssid, ch, rssi);
            }
        }
    }

    esp32_wifi_ip_t ip;
    if (esp32_wifi_get_ip(&ip) == 0) {
        printf("Address    : IP=%s  GW=%s  MASK=%s\r\n",
               ip.ip, ip.gateway, ip.netmask);
    }

    /* AT+CIPDNS? returns: +CIPDNS:<enable>,"<dns1>"[,"<dns2>"] */
    if (esp32_wifi_at_cmd("AT+CIPDNS?", resp, sizeof(resp), 2000) == 0) {
        const char *p = strstr(resp, "+CIPDNS:");
        if (p) printf("DNS        : %s\r\n", p + 8);
    }
    return 0;
}

/* ------------------------------------------------------------------ */
/* Case 3: Ping                                                        */
/* ------------------------------------------------------------------ */

static int cmd_demo_net_ping(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: demo_net_ping <host> [count]\r\n");
        printf("Example: demo_net_ping 8.8.8.8 4\r\n");
        return -1;
    }
    if (demo_require_ip() != 0)
        return -1;

    int count = (argc >= 3) ? atoi(argv[2]) : 4;
    if (count < 1) count = 1;
    if (count > 20) count = 20;

    const char *host = argv[1];
    char cmd[128];
    char resp[256];
    int ok = 0, fail = 0;

    printf("\r\nPinging %s x%d via ESP32...\r\n", host, count);
    for (int i = 1; i <= count; i++) {
        snprintf(cmd, sizeof(cmd), "AT+PING=\"%s\"", host);
        int rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 5000);
        if (rc == 0) {
            /* Response: +PING:<rtt_ms> */
            const char *p = strstr(resp, "+PING:");
            int rtt = p ? atoi(p + 6) : -1;
            printf("  [%d] %-20s OK   rtt=%d ms\r\n", i, host, rtt);
            ok++;
        } else {
            printf("  [%d] %-20s %s\r\n", i, host,
                   rc == -2 ? "TIMEOUT" : "ERROR");
            fail++;
        }
        vTaskDelay(pdMS_TO_TICKS(300));
    }
    printf("--- %s ping statistics ---\r\n", host);
    printf("%d transmitted, %d received, %d%% loss\r\n",
           count, ok, (int)(100 * fail / count));
    return (fail == 0) ? 0 : -1;
}

