INTELPRO-INC/IPRO-SDK/apps/platform/ipro7_demo/demo/esp32_at/demo_esp32_at.c
/* ------------------------------------------------------------------ */
/* Case 4: HTTP GET via AT+HTTPCGET                                    */
/* ------------------------------------------------------------------ */

static int cmd_demo_http_get(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: demo_http_get <url>\r\n");
        printf("Example: demo_http_get http://httpbin.org/ip\r\n");
        return -1;
    }
    if (demo_require_ip() != 0)
        return -1;

    const char *url = argv[1];
    if (strlen(url) > DEMO_URL_MAX - 32) {
        printf("[demo] URL too long (max %d)\r\n", DEMO_URL_MAX - 32);
        return -1;
    }

    static char cmd[DEMO_URL_MAX + 32];
    static char resp[DEMO_RESP_BUF];

    /* AT+HTTPCGET="<url>"[,<tx_size>,<rx_size>,<timeout>] */
    snprintf(cmd, sizeof(cmd), "AT+HTTPCGET=\"%s\"", url);
    printf("\r\n[demo] GET %s\r\n", url);

    int rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 20000);
    if (rc != 0) {
        printf("[demo] HTTP failed (rc=%d)\r\n", rc);
        return rc;
    }

    /* Response contains lines like:
     *   +HTTPCGET:<len>,<body_chunk>
     * followed by OK.
     */
    const char *body_start = strstr(resp, "+HTTPCGET:");
    if (!body_start) {
        printf("[demo] Unexpected reply:\r\n%s\r\n", resp);
        return -1;
    }
    /* Skip "+HTTPCGET:<len>," prefix to get the body chunk. */
    const char *comma = strchr(body_start, ',');
    const char *body  = comma ? comma + 1 : body_start;

    printf("----- response body -----\r\n%s\r\n-------------------------\r\n", body);
    return 0;
}

/* ------------------------------------------------------------------ */
/* Case 5: Reconnect loop with event callback                          */
/* ------------------------------------------------------------------ */

static SemaphoreHandle_t s_reconn_sem;
static volatile int      s_reconn_got_ip;

static void reconn_event_cb(esp32_wifi_state_t st, void *ctx)
{
    (void)ctx;
    if (st == ESP32_WIFI_STATE_GOT_IP) {
        s_reconn_got_ip = 1;
        if (s_reconn_sem)
            xSemaphoreGive(s_reconn_sem);
    }
}

static int cmd_demo_reconnect_loop(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: demo_reconnect_loop <iterations>\r\n");
        printf("Note: you must already be connected once — this loop will\r\n"
               "      reuse the stored credentials on the ESP32.\r\n");
        return -1;
    }
    if (demo_require_ip() != 0)
        return -1;

    int iter = atoi(argv[1]);
    if (iter < 1)  iter = 1;
    if (iter > 50) iter = 50;

    if (!s_reconn_sem) {
        s_reconn_sem = xSemaphoreCreateBinary();
        if (!s_reconn_sem) {
            printf("[demo] sem alloc failed\r\n");
            return -1;
        }
    }
    esp32_wifi_set_event_cb(reconn_event_cb, NULL);

    int ok = 0;
    uint32_t total_ms = 0, worst_ms = 0;

    for (int i = 1; i <= iter; i++) {
        s_reconn_got_ip = 0;
        xSemaphoreTake(s_reconn_sem, 0);

        printf("\r\n[iter %d/%d] disconnect...\r\n", i, iter);
        esp32_wifi_disconnect();
        vTaskDelay(pdMS_TO_TICKS(500));

        printf("[iter %d/%d] reconnect (AT+CWJAP)...\r\n", i, iter);
        TickType_t t0 = xTaskGetTickCount();

        /* Re-issue CWJAP with stored config. On ESP-AT the last-used creds
         * are persisted, so AT+CWJAP with no args re-uses them. */
        char resp[128];
        int rc = esp32_wifi_at_cmd("AT+CWJAP", resp, sizeof(resp), 20000);
        if (rc != 0) {
            printf("  CWJAP failed rc=%d\r\n", rc);
            continue;
        }

        /* Wait for GOT_IP URC */
        if (xSemaphoreTake(s_reconn_sem, pdMS_TO_TICKS(10000)) != pdTRUE) {
            printf("  no GOT_IP URC within 10 s\r\n");
            continue;
        }

        uint32_t dt = (xTaskGetTickCount() - t0) * portTICK_PERIOD_MS;
        total_ms += dt;
        if (dt > worst_ms) worst_ms = dt;
        ok++;
        printf("  reconnected in %u ms\r\n", (unsigned)dt);
    }

    esp32_wifi_set_event_cb(NULL, NULL);

    printf("\r\n=== Reconnect summary ===\r\n");
    printf("  success : %d / %d (%d%%)\r\n", ok, iter, (int)(100 * ok / iter));
    if (ok > 0) {
        printf("  avg time: %u ms\r\n", (unsigned)(total_ms / ok));
        printf("  worst   : %u ms\r\n", (unsigned)worst_ms);
    }
    return (ok == iter) ? 0 : -1;
}

/* ------------------------------------------------------------------ */
/* Case 6 (Tier 3): TCP client (active receive) + CIPSEND prompt       */
/* ------------------------------------------------------------------ */

static SemaphoreHandle_t s_ipd_sem;
static int               s_ipd_len;
static char              s_ipd_data[128];

/*
 * ESP-AT active-mode URC: "+IPD,<len>:<data>"
 *   The first line delivered to us already contains the data payload
 *   inline. at_client strips trailing CR/LF when forming the line so
 *   single-line text responses land here complete.
 */
static void tcp_ipd_urc(const char *line, void *ctx)
{
    (void)ctx;
    const char *colon = strchr(line, ':');
    const char *comma = strchr(line, ',');
    if (!comma) return;

    s_ipd_len = atoi(comma + 1);
    if (colon && colon > comma) {
        size_t n = strlen(colon + 1);
        if (n >= sizeof(s_ipd_data))
            n = sizeof(s_ipd_data) - 1;
        memcpy(s_ipd_data, colon + 1, n);
        s_ipd_data[n] = '\0';
    } else {
        s_ipd_data[0] = '\0';
    }
    if (s_ipd_sem)
        xSemaphoreGive(s_ipd_sem);
}

static int cmd_demo_tcp_client(int argc, char **argv)
{
    if (argc < 3) {
        printf("Usage: demo_tcp_client <host> <port>\r\n");
        printf("Example: demo_tcp_client tcpbin.com 4242   (echo server)\r\n");
        return -1;
    }
    if (demo_require_ip() != 0)
        return -1;

    at_client_t *at = esp32_wifi_get_at_client();
    if (!at) {
        printf("[demo] at_client not ready\r\n");
        return -1;
    }

    const char *host = argv[1];
    int port = atoi(argv[2]);
    char cmd[160];
    char resp[512];
    int rc;

    if (!s_ipd_sem)
        s_ipd_sem = xSemaphoreCreateBinary();
    xSemaphoreTake(s_ipd_sem, 0);
    s_ipd_len = 0;
    s_ipd_data[0] = '\0';

    printf("\r\n[demo] TCP client flow:\r\n");
    printf("        (1) AT+CIPMUX=0            (single connection)\r\n");
    printf("        (2) register +IPD URC      (active receive)\r\n");
    printf("        (3) AT+CIPSTART TCP %s:%d\r\n", host, port);
    printf("        (4) AT+CIPSEND=<len> + raw payload\r\n");
    printf("        (5) wait +IPD,<len>:<data> URC\r\n");
    printf("        (6) AT+CIPCLOSE\r\n\r\n");

    /* (1) single-connection mode */
    esp32_wifi_at_cmd("AT+CIPMUX=0", resp, sizeof(resp), 2000);

