INTELPRO-INC/IPRO-SDK/apps/platform/ipro7_demo/demo/esp32_at/demo_esp32_at.c
    /* (2) register URC for active-mode data delivery */
    at_client_register_urc(at, "+IPD,", tcp_ipd_urc, NULL);

    /* (3) connect */
    snprintf(cmd, sizeof(cmd), "AT+CIPSTART=\"TCP\",\"%s\",%d", host, port);
    rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 10000);
    if (rc != 0) {
        printf("[demo] CIPSTART failed: %s\r\n", resp);
        goto cleanup_urc;
    }
    printf("[demo] connected\r\n");

    /* (4) CIPSEND: ESP replies "OK\r\n>" so at_client_send_cmd returns on
     *     OK; the ">" byte sits in line_buf. We then raw-write the payload.
     *     ESP emits "Recv N bytes" + "SEND OK" which we don't explicitly
     *     wait for — we rely on the subsequent +IPD URC for the echo. */
    const char *payload = "hello from ipro7\r\n";
    int plen = (int)strlen(payload);

    snprintf(cmd, sizeof(cmd), "AT+CIPSEND=%d", plen);
    rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 2000);
    if (rc != 0) {
        printf("[demo] CIPSEND prep failed\r\n");
        goto cleanup_close;
    }
    vTaskDelay(pdMS_TO_TICKS(100));
    at_client_write(at, payload, plen);
    printf("[demo] sent %d bytes: %s", plen, payload);

    /* (5) wait for active-mode data */
    if (xSemaphoreTake(s_ipd_sem, pdMS_TO_TICKS(5000)) != pdTRUE) {
        printf("[demo] no +IPD URC within 5s\r\n");
        rc = -2;
        goto cleanup_close;
    }
    printf("[demo] received %d bytes:\r\n    \"%s\"\r\n",
           s_ipd_len, s_ipd_data);
    rc = 0;

cleanup_close:
    esp32_wifi_at_cmd("AT+CIPCLOSE", resp, sizeof(resp), 2000);
cleanup_urc:
    at_client_unregister_urc(at, "+IPD,");
    return rc;
}

/* ------------------------------------------------------------------ */
/* Case 7 (Tier 4): MQTT pub/sub round-trip                            */
/* ------------------------------------------------------------------ */

static SemaphoreHandle_t s_mqtt_sem;

static void mqtt_recv_urc(const char *line, void *ctx)
{
    (void)ctx;
    /* line: +MQTTSUBRECV:<link>,"<topic>",<len>,<data> */
    printf("[MQTT RECV] %s\r\n", line);
    if (s_mqtt_sem)
        xSemaphoreGive(s_mqtt_sem);
}

static int cmd_demo_mqtt_pubsub(int argc, char **argv)
{
    (void)argc; (void)argv;

    if (demo_require_ip() != 0)
        return -1;

    at_client_t *at = esp32_wifi_get_at_client();
    if (!at) {
        printf("[demo] at_client not ready\r\n");
        return -1;
    }

    char cmd[200];
    char resp[512];
    char cid[32];
    char topic[64];
    int rc;

    /* Unique client ID + topic per run so broker doesn't reject duplicates */
    unsigned tick = (unsigned)xTaskGetTickCount();
    snprintf(cid,   sizeof(cid),   "ipro7_%u", tick);
    snprintf(topic, sizeof(topic), "/ipro7/test/%u", tick);

    if (!s_mqtt_sem)
        s_mqtt_sem = xSemaphoreCreateBinary();
    xSemaphoreTake(s_mqtt_sem, 0);

    printf("\r\n[demo] MQTT pubsub on broker.hivemq.com\r\n");
    printf("        client : %s\r\n", cid);
    printf("        topic  : %s\r\n\r\n", topic);

    /* MQTTUSERCFG=<link>,<scheme>,<cid>,<user>,<pass>,<cert>,<CA>,<path>
     * scheme=1 -> MQTT over TCP, no TLS */
    snprintf(cmd, sizeof(cmd),
             "AT+MQTTUSERCFG=0,1,\"%s\",\"\",\"\",0,0,\"\"", cid);
    rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 3000);
    if (rc != 0) { printf("[demo] USERCFG fail\r\n"); goto done; }

    rc = esp32_wifi_at_cmd("AT+MQTTCONN=0,\"broker.hivemq.com\",1883,0",
                           resp, sizeof(resp), 15000);
    if (rc != 0) { printf("[demo] CONN fail: %s\r\n", resp); goto done; }
    printf("[demo] connected to broker\r\n");

    at_client_register_urc(at, "+MQTTSUBRECV:", mqtt_recv_urc, NULL);

    snprintf(cmd, sizeof(cmd), "AT+MQTTSUB=0,\"%s\",1", topic);
    rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 5000);
    if (rc != 0) { printf("[demo] SUB fail\r\n"); goto cleanup; }
    printf("[demo] subscribed\r\n");

    /* Publish a message that the broker will echo back to our own sub */
    snprintf(cmd, sizeof(cmd),
             "AT+MQTTPUB=0,\"%s\",\"hello from ipro7\",1,0", topic);
    rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 5000);
    if (rc != 0) { printf("[demo] PUB fail\r\n"); goto cleanup; }
    printf("[demo] published, waiting for echo...\r\n");

    if (xSemaphoreTake(s_mqtt_sem, pdMS_TO_TICKS(8000)) == pdTRUE) {
        printf("[demo] round-trip OK\r\n");
        rc = 0;
    } else {
        printf("[demo] no echo within 8s\r\n");
        rc = -2;
    }

cleanup:
    at_client_unregister_urc(at, "+MQTTSUBRECV:");
    esp32_wifi_at_cmd("AT+MQTTCLEAN=0", resp, sizeof(resp), 3000);
done:
    return rc;
}

/* ------------------------------------------------------------------ */
/* Case 8 (Tier 3+): MJPEG-over-HTTP server (RTSP alternative)         */
/* ------------------------------------------------------------------ */

/*
 * Serves a multipart/x-mixed-replace MJPEG stream from CIPSERVER so any
 * browser can open http://<ipro7_ip>:<port>/ and see animated frames.
 *
 * Production apps replace the frame source (mjpeg_frames[]) with live
 * camera capture — the rest of the flow is identical.
 */

static SemaphoreHandle_t s_srv_sem;
static volatile int      s_srv_link_id;
static volatile int      s_srv_closed;

static void srv_ipd_urc(const char *line, void *ctx)
{
    (void)ctx;
    /* "+IPD,<link>,<len>:..." — we only care that some client sent data */
    const char *p = strchr(line, ',');
    if (!p) return;
    s_srv_link_id = atoi(p + 1);
    if (s_srv_sem)
        xSemaphoreGive(s_srv_sem);
}

static void srv_closed_urc(const char *line, void *ctx)
{
    (void)line; (void)ctx;
    s_srv_closed = 1;
}

/* Send a CIPSEND-framed blob. ESP-AT's single CIPSEND is capped (2048 B in
 * default builds), so we chunk larger buffers. Each chunk: AT+CIPSEND=<link>,<n>
 * → wait prompt → raw write. */
#define SRV_CIPSEND_MAX  2048

static int srv_send_chunk(at_client_t *at, int link,
                          const void *data, int len)
{
    char cmd[48];
    char resp[64];
    snprintf(cmd, sizeof(cmd), "AT+CIPSEND=%d,%d", link, len);
    int rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 3000);
    if (rc != 0) return rc;
    vTaskDelay(pdMS_TO_TICKS(80));
    at_client_write(at, data, (uint32_t)len);
    /* leave enough time for ESP to ship and emit SEND OK before next cmd */
    vTaskDelay(pdMS_TO_TICKS(180));
    return 0;
}

static int srv_send(at_client_t *at, int link,
                    const void *data, int len)
{
    const uint8_t *p = (const uint8_t *)data;
    int remaining = len;
    while (remaining > 0) {
        int n = remaining > SRV_CIPSEND_MAX ? SRV_CIPSEND_MAX : remaining;
        int rc = srv_send_chunk(at, link, p, n);
        if (rc != 0) return rc;
        p         += n;
        remaining -= n;
    }
    return 0;
}

static int cmd_demo_mjpeg_server(int argc, char **argv)
{
    int port   = (argc >= 2) ? atoi(argv[1]) : 8080;
    int nframe = (argc >= 3) ? atoi(argv[2]) : 30;
    if (nframe < 1)   nframe = 1;
    if (nframe > 300) nframe = 300;

    if (demo_require_ip() != 0)
        return -1;

    at_client_t *at = esp32_wifi_get_at_client();
    if (!at) return -1;

