INTELPRO-INC/IPRO-SDK/apps/platform/ipro7_demo/demo/esp32_at/demo_esp32_at.c
    esp32_wifi_ip_t ip;
    esp32_wifi_get_ip(&ip);

    char cmd[96], resp[128];
    int rc;

    if (!s_srv_sem)
        s_srv_sem = xSemaphoreCreateBinary();
    xSemaphoreTake(s_srv_sem, 0);
    s_srv_link_id = -1;
    s_srv_closed  = 0;

    printf("\r\n[demo] MJPEG-over-HTTP server\r\n");
    printf("       open http://%s:%d/  in a browser\r\n", ip.ip, port);
    printf("       will serve %d frames then stop\r\n\r\n", nframe);

    /* Multi-conn + start server */
    esp32_wifi_at_cmd("AT+CIPMUX=1", resp, sizeof(resp), 2000);
    snprintf(cmd, sizeof(cmd), "AT+CIPSERVER=1,%d", port);
    rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 3000);
    if (rc != 0) {
        printf("[demo] CIPSERVER failed: %s\r\n", resp);
        goto cleanup_mux;
    }

    at_client_register_urc(at, "+IPD,",    srv_ipd_urc,    NULL);
    at_client_register_urc(at, "0,CLOSED", srv_closed_urc, NULL);

    /* Wait for HTTP GET from first client */
    printf("[demo] waiting for client (timeout 60s)...\r\n");
    if (xSemaphoreTake(s_srv_sem, pdMS_TO_TICKS(60000)) != pdTRUE) {
        printf("[demo] no client connected\r\n");
        rc = -2;
        goto cleanup;
    }
    int link = s_srv_link_id;
    printf("[demo] client on link %d, streaming...\r\n", link);

    /* HTTP/1.0 response header announcing multipart stream */
    const char *hdr =
        "HTTP/1.0 200 OK\r\n"
        "Content-Type: multipart/x-mixed-replace; boundary=frame\r\n"
        "Cache-Control: no-cache\r\n"
        "Connection: close\r\n\r\n";
    if (srv_send(at, link, hdr, (int)strlen(hdr)) != 0) {
        printf("[demo] send header failed\r\n");
        goto cleanup_close;
    }

    /* Per-frame: part header + JPEG bytes + CRLF */
    for (int i = 0; i < nframe; i++) {
        if (s_srv_closed) {
            printf("[demo] client closed at frame %d\r\n", i);
            break;
        }
        int idx = i % MJPEG_FRAME_COUNT;
        const uint8_t *jpeg = mjpeg_frames[idx];
        int jlen = (int)mjpeg_frames_len[idx];

        char part[128];
        int plen = snprintf(part, sizeof(part),
                            "--frame\r\n"
                            "Content-Type: image/jpeg\r\n"
                            "Content-Length: %d\r\n\r\n", jlen);

        if (srv_send(at, link, part, plen) != 0) break;
        if (srv_send(at, link, jpeg, jlen) != 0) break;
        if (srv_send(at, link, "\r\n", 2)    != 0) break;

        if ((i & 3) == 0)
            printf("[demo] frame %d/%d\r\n", i + 1, nframe);
    }

    printf("[demo] streaming complete\r\n");

cleanup_close:
    snprintf(cmd, sizeof(cmd), "AT+CIPCLOSE=%d", link);
    esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 2000);
cleanup:
    at_client_unregister_urc(at, "+IPD,");
    at_client_unregister_urc(at, "0,CLOSED");
    esp32_wifi_at_cmd("AT+CIPSERVER=0", resp, sizeof(resp), 2000);
cleanup_mux:
    esp32_wifi_at_cmd("AT+CIPMUX=0", resp, sizeof(resp), 2000);
    return rc;
}

/* ------------------------------------------------------------------ */
/* Case 9: MJPEG-over-HTTP with LIVE camera frames (via ISP pipeline)  */
/* ------------------------------------------------------------------ */
/*
 * Taps into the ISP + MJPEG encoder pipeline already running inside
 * demo/mm/stream_control.c. User must start the pipeline first with
 * the `dvp_sensor` shell command. An observer callback registered into
 * stream_control copies each freshly-encoded JPEG into a staging
 * buffer; the HTTP server task pulls from the staging buffer on every
 * multipart iteration.
 */

#define DEMO_LIVE_JPG_CAP   (64 * 1024)

/* Forward declaration of stream_control's observer registration. */
extern void strmctrl_set_jpeg_observer(
    void (*cb)(const void *buf, uint32_t size, void *ctx), void *ctx);

static uint8_t          *s_live_buf;
static volatile uint32_t s_live_size;
static SemaphoreHandle_t s_live_sem;
static volatile bool     s_live_active;

static void live_jpeg_observer(const void *buf, uint32_t size, void *ctx)
{
    (void)ctx;
    if (!s_live_active) return;
    if (size == 0 || size > DEMO_LIVE_JPG_CAP) return;
    /* Drop frames while server is still shipping the previous one — no
     * pipelining, HTTP is slower than the camera. */
    if (s_live_size != 0) return;
    memcpy(s_live_buf, buf, size);
    s_live_size = size;
    if (s_live_sem)
        xSemaphoreGive(s_live_sem);
}

static int cmd_demo_mjpeg_live(int argc, char **argv)
{
    int port   = (argc >= 2) ? atoi(argv[1]) : 8080;
    int nframe = (argc >= 3) ? atoi(argv[2]) : 60;
    if (nframe < 1)    nframe = 1;
    if (nframe > 1000) nframe = 1000;

    if (demo_require_ip() != 0)
        return -1;

    at_client_t *at = esp32_wifi_get_at_client();
    if (!at) return -1;

    esp32_wifi_ip_t ip;
    esp32_wifi_get_ip(&ip);

    /* One-time staging buffer for the latest JPEG */
    if (!s_live_buf) {
        s_live_buf = pvPortMalloc(DEMO_LIVE_JPG_CAP);
        if (!s_live_buf) {
            printf("[demo] failed to alloc live buffer\r\n");
            return -1;
        }
    }
    if (!s_live_sem)
        s_live_sem = xSemaphoreCreateBinary();
    if (!s_srv_sem)
        s_srv_sem = xSemaphoreCreateBinary();

    char cmd[96], resp[128];
    int rc;

    xSemaphoreTake(s_srv_sem,  0);
    xSemaphoreTake(s_live_sem, 0);
    s_srv_link_id = -1;
    s_srv_closed  = 0;
    s_live_size   = 0;
    s_live_active = true;

    /* Subscribe to the camera pipeline */
    strmctrl_set_jpeg_observer(live_jpeg_observer, NULL);

    printf("\r\n[demo] MJPEG-over-HTTP server (LIVE camera)\r\n");
    printf("       open http://%s:%d/  in a browser or curl\r\n", ip.ip, port);
    printf("       prerequisite: run `dvp_sensor` once to bring up ISP\r\n");
    printf("       will serve up to %d frames then stop\r\n\r\n", nframe);

    /* Same CIPSERVER setup as demo_mjpeg_server */
    esp32_wifi_at_cmd("AT+CIPMUX=1", resp, sizeof(resp), 2000);
    snprintf(cmd, sizeof(cmd), "AT+CIPSERVER=1,%d", port);
    rc = esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 3000);
    if (rc != 0) {
        printf("[demo] CIPSERVER failed: %s\r\n", resp);
        goto cleanup_mux;
    }

    at_client_register_urc(at, "+IPD,",    srv_ipd_urc,    NULL);
    at_client_register_urc(at, "0,CLOSED", srv_closed_urc, NULL);

    printf("[demo] waiting for client (timeout 60s)...\r\n");
    if (xSemaphoreTake(s_srv_sem, pdMS_TO_TICKS(60000)) != pdTRUE) {
        printf("[demo] no client connected\r\n");
        rc = -2;
        goto cleanup;
    }
    int link = s_srv_link_id;
    printf("[demo] client on link %d, streaming live...\r\n", link);

    const char *hdr =
        "HTTP/1.0 200 OK\r\n"
        "Content-Type: multipart/x-mixed-replace; boundary=frame\r\n"
        "Cache-Control: no-cache\r\n"
        "Connection: close\r\n\r\n";
    if (srv_send(at, link, hdr, (int)strlen(hdr)) != 0) {
        printf("[demo] send header failed\r\n");
        goto cleanup_close;
    }

    int sent_ok = 0;
    for (int i = 0; i < nframe; i++) {
        if (s_srv_closed) {
            printf("[demo] client closed at frame %d\r\n", i);
            break;
        }

