INTELPRO-INC/IPRO-SDK/apps/platform/ipro7_demo/demo/esp32_at/demo_esp32_at.c
        /* Block until the ISP pipeline coughs up a frame. */
        if (xSemaphoreTake(s_live_sem, pdMS_TO_TICKS(5000)) != pdTRUE) {
            printf("[demo] no live frame within 5s - is `dvp_sensor` running?\r\n");
            rc = -3;
            break;
        }

        uint32_t jlen = s_live_size;
        /* While we ship this frame, allow the observer to accept the next. */

        char part[128];
        int plen = snprintf(part, sizeof(part),
                            "--frame\r\n"
                            "Content-Type: image/jpeg\r\n"
                            "Content-Length: %u\r\n\r\n", (unsigned)jlen);

        if (srv_send(at, link, part,        plen)      != 0) { s_live_size = 0; break; }
        if (srv_send(at, link, s_live_buf,  (int)jlen) != 0) { s_live_size = 0; break; }
        if (srv_send(at, link, "\r\n",      2)         != 0) { s_live_size = 0; break; }

        /* Release slot for the next observer callback. */
        s_live_size = 0;
        sent_ok++;

        if ((sent_ok & 3) == 1)
            printf("[demo] live frame %d/%d (%u B)\r\n", sent_ok, nframe, (unsigned)jlen);
    }

    printf("[demo] live streaming complete (%d/%d frames)\r\n", sent_ok, nframe);

cleanup_close:
    snprintf(cmd, sizeof(cmd), "AT+CIPCLOSE=%d", link);
    esp32_wifi_at_cmd(cmd, resp, sizeof(resp), 2000);
cleanup:
    at_client_unregister_urc(at, "+IPD,");
    at_client_unregister_urc(at, "0,CLOSED");
    esp32_wifi_at_cmd("AT+CIPSERVER=0", resp, sizeof(resp), 2000);
cleanup_mux:
    esp32_wifi_at_cmd("AT+CIPMUX=0", resp, sizeof(resp), 2000);
    s_live_active = false;
    strmctrl_set_jpeg_observer(NULL, NULL);
    return rc;
}

/* ------------------------------------------------------------------ */
/* Shell registration                                                  */
/* ------------------------------------------------------------------ */

SHELL_CMD_EXPORT_ALIAS(cmd_demo_wifi_scan,       demo_wifi_scan,
                       Scan Wi-Fi APs via AT+CWLAP);
SHELL_CMD_EXPORT_ALIAS(cmd_demo_net_info,        demo_net_info,
                       Show link info (SSID/RSSI/IP/DNS));
SHELL_CMD_EXPORT_ALIAS(cmd_demo_net_ping,        demo_net_ping,
                       Ping host via AT+PING);
SHELL_CMD_EXPORT_ALIAS(cmd_demo_http_get,        demo_http_get,
                       HTTP GET via AT+HTTPCGET);
SHELL_CMD_EXPORT_ALIAS(cmd_demo_reconnect_loop,  demo_reconnect_loop,
                       Reconnect soak test);
SHELL_CMD_EXPORT_ALIAS(cmd_demo_tcp_client,      demo_tcp_client,
                       TCP client passive-receive demo);
SHELL_CMD_EXPORT_ALIAS(cmd_demo_mqtt_pubsub,     demo_mqtt_pubsub,
                       MQTT pub-sub round-trip demo);
SHELL_CMD_EXPORT_ALIAS(cmd_demo_mjpeg_server,    demo_mjpeg_server,
                       MJPEG over HTTP server (RTSP alternative));
SHELL_CMD_EXPORT_ALIAS(cmd_demo_mjpeg_live,      demo_mjpeg_live,
                       MJPEG over HTTP with live camera via ISP);
